<?php
/**
 * 配置
 * @author mybsdc <mybsdc@gmail.com>
 * @date 2019/3/2
 * @time 11:39
 */

return [
    /**
     * 课表
     */
    'classes' => [ // 0（表示星期天）到 6（表示星期六）
        0 => [],
        1 => [
            '08:45-09:05' => '数学',
            '09:15-09:55' => '数学',
            '10:25-11:05' => '',
            '11:20-12:00' => '4年级的英语',

            '12:00-13:00' => '', // 午饭
            '13:00-14:00' => '午睡', // 数学

            '14:00-14:40' => '',
            '14:55-15:35' => '',
            '15:45-16:25' => '数学',
        ],
        2 => [
            '08:45-09:05' => '数学',
            '09:15-09:55' => '数学',
            '10:25-11:05' => '数学',
            '11:20-12:00' => '3年级的英语',

            '12:00-13:00' => '', // 午饭
            '13:00-14:00' => '午睡',

            '14:00-14:40' => '',
            '14:55-15:35' => '',
            '15:45-16:25' => '',
        ],
        3 => [
            '08:45-09:05' => '数学',
            '09:15-09:55' => '数学',
            '10:25-11:05' => '体育',
            '11:20-12:00' => '',

            '12:00-13:00' => '',
            '13:00-14:00' => '午睡',

            '14:00-14:40' => '',
            '14:55-15:35' => '',
            '15:45-16:25' => '',
        ],
        4 => [
            '08:45-09:05' => '',
            '09:15-09:55' => '',
            '10:25-11:05' => '4年级的英语',
            '11:20-12:00' => '',

            '12:00-13:00' => '',
            '13:00-14:00' => '午睡', // 数学

            '14:00-14:40' => '数学',
            '14:55-15:35' => '数学',
            '15:45-16:25' => '体育',
        ],
        5 => [
            '08:45-09:05' => '',
            '09:15-09:55' => '',
            '10:25-11:05' => '',
            '11:20-12:00' => '数学',

            '12:00-13:00' => '',
            '13:00-14:00' => '午睡', // 数学

            '14:00-14:40' => '3年级的英语',
            '14:55-15:35' => '体育',
            '15:45-16:25' => '',
        ],
        6 => []
    ],

    /**
     * 其它配置
     */
    'inAdvance' => 180, // 提前3分钟推送课程提醒
    'debug' => false,
    'stdout' => false, // 输出Log到控制台

    /**
     * 邮箱配置
     */
    'mail' => [
        'from' => 'llf.push@gmail.com', // 发件人
        'to' => 'mybsdc@qq.com', // 收件人
        'replyTo' => 'mybsdc@gmail.com', // 接收回复的邮箱
        'username' => env('MAIL_USERNAME'), // 邮箱账户
        'password' => env('MAIL_PASSWORD'), // 邮箱密码
        'debug' => 0, // debug，当邮件无法发送的情况下开启此项观察命令行界面提示信息，正式环境应关闭 0：关闭 1：客户端信息 2：客户端和服务端信息
    ],

    /**
     * 指定关键字，用于过滤低质量诗词
     */
    'lowQualityKeywords' => [
        '贫贱',
        '妇人',
        '死',
        '坟',
        '冢',
    ],

    /**
     * 微信机器人配置
     */
    'weChat' => [
        'path' => APP_PATH . 'tmp/',

        /*
         * swoole 配置项，执行主动发消息命令必须开启
         */
        'swoole' => [
            'status' => false,
            'ip' => '127.0.0.1',
            'port' => '8866',
        ],

        /*
         * 下载配置项
         */
        'download' => [
            'image' => false,
            'voice' => false,
            'video' => false,
            'emoticon' => true,
            'file' => false,
            'emoticon_path' => APP_PATH . 'tmp/emoticons/',
        ],

        /*
         * 输出配置项
         */
        'console' => [
            'output' => true, // 是否输出
            'message' => true, // 是否输出接收消息 （若上面为 false 此处无效）
        ],

        /*
         * 日志配置项
         */
        'log' => [
            'level' => 'debug',
            'permission' => 0777,
            'system' => APP_PATH . 'tmp/log',
            'message' => APP_PATH . 'tmp/log',
        ],

        /*
         * 缓存配置项
         */
        'cache' => [
            'default' => 'file',
            'stores' => [
                'file' => [
                    'driver' => 'file',
                    'path' => APP_PATH . 'tmp/cache',
                ],
                'redis' => [
                    'driver' => 'redis',
                    'connection' => 'default',
                ],
            ],
        ],
        'database' => [
            'redis' => [
                'client' => 'predis',
                'default' => [
                    'host' => '127.0.0.1',
                    'password' => null,
                    'port' => 6379,
                    'database' => 13,
                ],
            ],
        ],

        /*
         * 拓展配置
         */
        'extension' => [
            'admin' => [
                'remark' => '',
                'nickname' => 'mybsdc',
            ],
        ],
    ],
];